Revit 2024 API
ExportDGNSettings Class
 This element contains DGN export settings which are saved in a Revit document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class ExportDGNSettings : Element
Visual Basic
Public Class ExportDGNSettings _
	Inherits Element
Visual C++
public ref class ExportDGNSettings : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ExportDGNSettings
See Also
ExportDGNSettings Members
Autodesk.Revit.DB Namespace